from stt import speech_to_text
from tts import speak
from agent import agent_step

USER_TELUGU = [
    "నాకు ప్రభుత్వ పథకాల వివరాలు కావాలి",
    "నా వయస్సు అరవై ఐదు సంవత్సరాలు",
    "నా వార్షిక ఆదాయం ఒక లక్ష రూపాయలు",
    "నేను రైతును"
]

print("🤖 ప్రభుత్వ పథకాల వాయిస్ ఏజెంట్ ప్రారంభించబడింది")

while True:
    turn_id, raw_text = speech_to_text()

    if turn_id is None:
        print("")
        break

    print("📝 వినియోగదారు:", USER_TELUGU[turn_id])

    response = agent_step(turn_id)
    print("🤖 ఏజెంట్:", response)

    speak(response)
